config.org
# -*- eval: (add-hook 'after-save-hook 'org-babel-tangle 'append 'local) -*-
#+title: Emacs Configuration
#+startup: show2levels

* Early-Init
:PROPERTIES:
:HEADER-ARGS: :tangle early-init.el
:END:
** borg initialization
#+begin_src emacs-lisp
  ;;; early-init.el --- earliest birds               -*- lexical-binding: t -*-

  (setq load-prefer-newer t)

  (add-to-list 'load-path
               (expand-file-name
                "lib/auto-compile"
                (file-name-directory (or load-file-name buffer-file-name))))
  (require 'auto-compile)
  (auto-compile-on-load-mode)
  (auto-compile-on-save-mode)

  (setq package-enable-at-startup nil)

  (with-eval-after-load 'package
    (add-to-list 'package-archives
                 (cons "melpa" "https://melpa.org/packages/")
                 t))
#+end_src

** Personal
#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum)
  (setq gc-cons-percentage 0.6)
  (setq package-enable-at-startup nil)
  (setq package-quickstart nil)

  (setq frame-inhibit-implied-resize t)

  (scroll-bar-mode -1)
  (setq inhibit-splash-screen t)
  (setq use-file-dialog nil)

  (setenv "LSP_USE_PLISTS" "true")
  (setq lsp-use-plists t)
#+end_src
** END
#+begin_src emacs-lisp
  (provide 'early-init)

  ;; Local Variables:
  ;; no-byte-compile: t
  ;; indent-tabs-mode: nil
  ;; End:
  ;;; early-init.el ends here
#+end_src


* Init
:PROPERTIES:
:HEADER-ARGS: :tangle init.el
:END:
Set up the *borg* configuration.
** start
#+begin_src emacs-lisp
  ;;; init.el --- user-init-file                    -*- lexical-binding: t -*-
  ;;; Early birds
#+end_src
** borg
#+begin_src emacs-lisp
  (progn ;     startup
    (defvar before-user-init-time (current-time)
      "Value of `current-time' when Emacs begins loading `user-init-file'.")
    (message "Loading Emacs...done (%.3fs)"
             (float-time (time-subtract before-user-init-time
                                        before-init-time)))
    (setq user-init-file (or load-file-name buffer-file-name))
    (setq user-emacs-directory (file-name-directory user-init-file))
    (message "Loading %s..." user-init-file)
    (when (< emacs-major-version 27)
      (setq package-enable-at-startup nil)
      ;; (package-initialize)
      (load-file (expand-file-name "early-init.el" user-emacs-directory)))
    (setq inhibit-startup-buffer-menu t)
    (setq inhibit-startup-screen t)
    (setq inhibit-startup-echo-area-message "locutus")
    (setq initial-buffer-choice t)
    (setq initial-scratch-message "")
    (when (fboundp 'scroll-bar-mode)
      (scroll-bar-mode 0))
    (when (fboundp 'tool-bar-mode)
      (tool-bar-mode 0))
    (menu-bar-mode 0))

  (eval-and-compile ; `borg'
    (add-to-list 'load-path (expand-file-name "lib/borg" user-emacs-directory))
    (require 'borg)
    (borg-initialize))

  (eval-and-compile ; `use-package'
    (setopt use-package-enable-imenu-support t)
    (setopt use-package-verbose t)
    (require 'use-package))

  (use-package compat)

  (use-package dash
    :config (global-dash-fontify-mode))

  (use-package eieio)

  (use-package auto-compile
    :config
    (setq auto-compile-display-buffer               nil)
    (setq auto-compile-mode-line-counter            t)
    (setq auto-compile-source-recreate-deletes-dest t)
    (setq auto-compile-toggle-deletes-nonlib-dest   t)
    (setq auto-compile-update-autoloads             t))

  (use-package epkg
    :defer t
    :init
    (setq epkg-repository
          (expand-file-name "var/epkgs/" user-emacs-directory))
    (setq epkg-database-connector
          (if (>= emacs-major-version 29) 'sqlite-builtin 'sqlite-module)))

  (use-package custom
    :no-require t
    :config
    (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
    (when (file-exists-p custom-file)
      (load custom-file)))

  (use-package server
    :functions (server-running-p)
    :config (or (server-running-p) (server-mode)))

  (progn ;     startup
    (message "Loading early birds...done (%.3fs)"
             (float-time (time-subtract (current-time)
                                        before-user-init-time))))

  ;;; Long tail

  (use-package diff-hl
    :config
    (setq diff-hl-draw-borders nil)
    (global-diff-hl-mode)
    (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh t))

  (use-package diff-mode
    :defer t
    :config
    (when (>= emacs-major-version 27)
      (set-face-attribute 'diff-refine-changed nil :extend t)
      (set-face-attribute 'diff-refine-removed nil :extend t)
      (set-face-attribute 'diff-refine-added   nil :extend t)))

  (use-package dired
    :defer t
    :config (setq dired-listing-switches "-alh"))

  (use-package eldoc
    :when (version< "25" emacs-version)
    :config (global-eldoc-mode))

  (use-package help
    :defer t
    :config (temp-buffer-resize-mode))

  (progn ;    `isearch'
    (setq isearch-allow-scroll t))

  (use-package lisp-mode
    :config
    (add-hook 'emacs-lisp-mode-hook 'outline-minor-mode)
    (add-hook 'emacs-lisp-mode-hook 'reveal-mode)
    (defun indent-spaces-mode ()
      (setq indent-tabs-mode nil))
    (add-hook 'lisp-interaction-mode-hook 'indent-spaces-mode))


  (use-package magit
    :defer t
    :commands (magit-add-section-hook)
    :config
    (magit-add-section-hook 'magit-status-sections-hook
                            'magit-insert-modules
                            'magit-insert-stashes
                            'append))

  (use-package man
    :defer t
    :config (setq Man-width 80))

  (use-package paren
    :config (show-paren-mode))

  (use-package prog-mode
    :config (global-prettify-symbols-mode)
    (defun indicate-buffer-boundaries-left ()
      (setq indicate-buffer-boundaries 'left))
    (add-hook 'prog-mode-hook 'indicate-buffer-boundaries-left))

  (use-package recentf
    :demand t
    :config (add-to-list 'recentf-exclude "^/\\(?:ssh\\|su\\|sudo\\)?x?:"))

  (use-package savehist
    :config (savehist-mode))

  (use-package saveplace
    :when (version< "25" emacs-version)
    :config (save-place-mode))

  (use-package simple
    :config (column-number-mode))

  (use-package smerge-mode
    :defer t
    :config
    (when (>= emacs-major-version 27)
      (set-face-attribute 'smerge-refined-removed nil :extend t)
      (set-face-attribute 'smerge-refined-added   nil :extend t)))

  (progn ;    `text-mode'
    (add-hook 'text-mode-hook 'indicate-buffer-boundaries-left))

  (use-package tramp
    :defer t
    :config
    (add-to-list 'tramp-default-proxies-alist '(nil "\\`root\\'" "/ssh:%h:"))
    (add-to-list 'tramp-default-proxies-alist '("localhost" nil nil))
    (add-to-list 'tramp-default-proxies-alist
                 (list (regexp-quote (system-name)) nil nil))
    (setq vc-ignore-dir-regexp
          (format "\\(%s\\)\\|\\(%s\\)"
                  vc-ignore-dir-regexp
                  tramp-file-name-regexp)))

  (use-package tramp-sh
    :defer t
    :config (cl-pushnew 'tramp-own-remote-path tramp-remote-path))

  ;;; Tequila worms

  (progn ;     startup
    (message "Loading %s...done (%.3fs)" user-init-file
             (float-time (time-subtract (current-time)
                                        before-user-init-time)))
    (add-hook 'after-init-hook
              (lambda ()
                (message
                 "Loading %s...done (%.3fs) [after-init]" user-init-file
                 (float-time (time-subtract (current-time)
                                            before-user-init-time))))
              t))

  (progn ;     personalize
    (let ((file (expand-file-name (concat (user-real-login-name) ".el")
                                  user-emacs-directory)))
      (when (file-exists-p file)
        (load file))))
#+end_src

** performance tweak
#+begin_src elisp
  ;; mainly come from
  ;; https://emacsredux.com/blog/2026/04/07/stealing-from-the-best-emacs-configs/

  ;; garbage collection
  (setq gc-cons-threshold (* 128 1024 1024))

  ;; ??? Process performance tuning
  (setq read-process-output-max (* 4 1024 1024))
  (setq process-adaptive-read-buffering nil)

  ;; skip delay
  (setq redisplay-skip-fontification-on-input t)

  ;; 禁止双向显示文字
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)
  (setq bidi-inhibit-bpa t
        long-line-threshold 1000
        large-hscroll-threshold 1000
        syntax-wholeline-max 1000)

  ;; avoid rendering cursor in other windows
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)

  ;; save pasteboard before killing
  (setq save-interprogram-paste-before-kill t)
  (setq kill-do-not-save-duplicates t)

  (setq reb-re-syntax 'string)

  ;; (setq window-combination-resize t)

  (save-place-mode 1)
  (advice-add 'save-place-find-file-hook :after
              (lambda (&rest _)
                (when buffer-file-name (ignore-errors (recenter)))))

  (setq help-window-select t)
  (setq jit-lock-defer-time 0.05)
#+end_src
** Require

#+begin_src emacs-lisp
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
  ;; add you personal config
  ;; (dolist (dir '("lisp"))
  ;;   (push (expand-file-name dir user-emacs-directory) load-path))
  ;; add the subdirectory
  ;; (dolist (dir '("site-lisp" "test-lisp"))
  ;;   (let ((default-directory (expand-file-name dir user-emacs-directory)))
  ;;     (normal-top-level-add-subdirs-to-load-path))) ;;how this work


  ;; Now we only need many require command
  ;; (require 'init-base)

  (eval-and-compile
    (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory)))
  ;; inside
  (require 'init-env)
  (require 'init-ui)
  (require 'init-org)

  ;; outside
  (require 'init-rainbow-delimiters)
  (require 'init-which-key)
  (require 'init-yasnippet)
  (require 'init-completion)
  ;; (require 'init-eglot)
  (require 'init-dirvish)
  (require 'init-projectile)
  (require 'init-latex)

  (require 'init-check)
  (require 'init-completion)
  (require 'init-markdown-mode)
  ;; (require 'init-font)
  (require 'init-visual-regexp)
  (require 'init-org-roam)
  (require 'init-indent)
  (require 'init-electric-pair-mode)

  (require 'init-csv-mode)
  (require 'init-org-download)
  (require 'init-org-roam-ui)
  (require 'init-treesit)
  (require 'init-treesit-fold)
  (require 'init-yaml-mode)
  (require 'init-org-fragtog)
  (require 'init-sudo-edit)
  (require 'init-move-text)
  (require 'init-ai)
  (require 'init-ace-window)

  (require 'init-leetcode)
  (require 'init-personal)

  (require 'org)

  (require 'init-test)
#+end_src

** END
#+begin_src emacs-lisp
  (provide 'init)

  ;; Local Variables:
  ;; indent-tabs-mode: nil
  ;; End:
  ;;; init.el ends here
#+end_src
* Lisp
** env
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-env.el
:END:

设置一些基本的环境变量
*** Default coding system
#+begin_src elisp
  (setq system-time-locale "en_US.utf8")

  (prefer-coding-system       'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-language-environment   'utf-8)
#+end_src
*** envrc
设置基于项目文件夹地址的环境变量。
#+begin_src elisp
  (require 'envrc)
  (envrc-global-mode)
#+end_src
*** others
对于我设置的系统 default 内容，在用户目录下自动禁止启动会好一点。
#+begin_src elisp
  (setq inhibit-default-init t)
#+end_src
*** END
#+begin_src elisp
  (provide 'init-env)
#+end_src
** ui
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-ui.el
:END:
设置调整 Emacs 的 UI 界面。
*** base
#+begin_src emacs-lisp
  (setq multibyte-syntax-as-symbol t)
  ;; (setq-default line-spacing .1)

  ;; 减少闪烁
  (modify-frame-parameters nil '((inhibit-double-buffering . nil)))

  (customize-set-variable 'fill-column 80)
  (add-hook 'text-mode-hook 'visual-line-mode)

  (setq global-display-fill-column-indicator-mode
        '((not help-mode
               eat-mode)
          t))
  (add-hook 'after-init-hook #'global-display-fill-column-indicator-mode)

  (add-hook 'prog-mode-hook #'(lambda () (display-line-numbers-mode 1)))
  (setq display-line-numbers-type 'relative)
  (global-so-long-mode 1)

  (setq next-screen-context-lines 2)

  (setq enable-recursive-minibuffers +1)
  (setq cursor-in-non-selected-windows nil)

  (setq hl-line-sticky-flag nil)
  (setq hl-line-range-function
        (lambda () (cons (line-end-position)
                    (line-beginning-position 2))))
  (global-hl-line-mode 1)
#+end_src
*** theme

#+begin_src elisp
  (load-theme 'modus-operandi)
#+end_src


*** font
#+begin_src emacs-lisp
  (setq initial-frame-alist
        (append (list (cons 'font "Maple Mono NF CN-12"))
                initial-frame-alist))
  (setq default-frame-alist
        (append (list (cons 'font "Maple Mono NF CN-12"))
                default-frame-alist))

  (when (display-graphic-p)
    (set-frame-font "Maple Mono NF CN-12" t t))

  (set-face-attribute 'variable-pitch nil
                      :family "Noto Serif"
                      :height 120
                      :weight 'normal)
#+end_src
